Backend/app/models/user.rb

SELECT 1 AS one FROM "users" WHERE LOWER("users"."email") = LOWER(?) AND "users"."id" != ? LIMIT ?  [["email", "[FILTERED]"], ["id", 2], ["LIMIT", 1]]
---
  def normalize_email
    self.email = email.downcase.strip if email.present?