Backend/lib/tasks/clean_data.rake

  task clean_data: :environment do
    puts "🧹 Starting database cleanup..."

    # Disable foreign key checks temporarily
    ActiveRecord::Base.connection.execute("PRAGMA foreign_keys = OFF") if Rails.env.development?

    # Delete all records from all tables in order (respecting foreign keys)
    puts "Deleting sale_items..."
    SaleItem.delete_all

    puts "Deleting sales..."
    Sale.delete_all

    puts "Deleting customers..."
    Customer.delete_all

    puts "Deleting products..."
    Product.delete_all

    puts "Deleting discounts..."
    Discount.delete_all
---
DELETE FROM "sale_items"
DELETE FROM "customers"
DELETE FROM "products"
DELETE FROM "discounts"


    puts "✅ Database cleanup completed!"
    puts "📊 Current record counts:"
    puts "- Users: #{User.count}"
    puts "- Customers: #{Customer.count}"
    puts "- Products: #{Product.count}"
    puts "- Sales: #{Sale.count}"
    puts "- Sale Items: #{SaleItem.count}"
    puts "- Discounts: #{Discount.count}"
---
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "customers"
SELECT COUNT(*) FROM "products"
SELECT COUNT(*) FROM "sales"
SELECT COUNT(*) FROM "sale_items"
SELECT COUNT(*) FROM "discounts"