Backend/lib/tasks/create_simple_admin.rake

SELECT 1 AS one FROM "users" LIMIT ?  [["LIMIT", 1]]
INSERT INTO "users" ("email", "first_name", "last_name", "role", "password_digest", "two_factor_secret", "two_factor_enabled", "phone", "last_sign_in_at", "current_sign_in_at", "sign_in_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  task create_simple: :environment do
    puts "🔐 Creating default admin user for Little Bee's POS System"
    puts "=" * 60

    # Check if there are any existing users
    if User.any?
      puts "⚠️  Users already exist in the system:"
      User.all.each do |user|
        puts "   - #{user.email} (#{user.role})"
      end
      puts "\n❌ Please clean the database first or use a different email."
      exit
    end

    # Default admin credentials
    admin_data = {
      email: 'admin@littlebees.com',
      first_name: 'Admin',
      last_name: 'User',
      password: 'admin123',
      role: 'admin',
      two_factor_enabled: false
    }

    puts "\n🔨 Creating admin user with default credentials..."
    puts "📧 Email: #{admin_data[:email]}"
    puts "🔑 Password: #{admin_data[:password]}"
    puts "👤 Name: #{admin_data[:first_name]} #{admin_data[:last_name]}"

    begin
      admin = User.create!(admin_data)