Backend/lib/tasks/create_admin.rake

SELECT 1 AS one FROM "users" LIMIT ?  [["LIMIT", 1]]
---
  task create: :environment do
    puts "🔐 Creating your first admin user for Little Bee's POS System"
    puts "=" * 60

    # Check if there are any existing users
    if User.any?