Backend/app/controllers/api/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "[FILTERED]"], ["LIMIT", 1]]
---
  def login
    user = User.find_by(email: params[:email]&.downcase&.strip)

UPDATE "users" SET "last_sign_in_at" = ?, "current_sign_in_at" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_sign_in_at", "2025-09-16 19:49:36.509916"], ["current_sign_in_at", "2025-09-16 20:01:05.375794"], ["sign_in_count", 2], ["updated_at", "2025-09-16 20:01:05.384348"], ["id", 2]]
---
      end
    else
      # Increment failed attempts
      user.increment_failed_attempts!

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "last_sign_in_at" = ?, "current_sign_in_at" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_sign_in_at", "2025-09-16 20:26:22.644660"], ["current_sign_in_at", "2025-09-16 20:54:15.806972"], ["sign_in_count", 7], ["updated_at", "2025-09-16 20:54:15.818801"], ["id", 2]]
---
  def verify_two_factor
    user = User.find(params[:user_id])
    code = params[:code]
    method = params[:method] || 'totp' # Default to TOTP

    verified = case method
               when 'totp'
                 user.verify_two_factor(code)
               when 'sms'
                 user.verify_sms_code(code)
               else
                 false
               end

    if verified
      complete_login(user)
    else
      user.increment_failed_attempts!

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def request_sms_code
    user = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "last_sign_in_at" = ?, "current_sign_in_at" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_sign_in_at", "2025-09-16 19:49:36.509916"], ["current_sign_in_at", "2025-09-16 20:01:05.375794"], ["sign_in_count", 2], ["updated_at", "2025-09-16 20:01:05.384348"], ["id", 2]]
---
  def change_password
    user = User.find(params[:user_id])

    unless user.authenticate(params[:current_password])
      render json: {
        success: false,
        message: 'Current password is incorrect'
      }, status: :unauthorized
      return
    end

    if user.update(password: params[:new_password], must_change_password: false)

UPDATE "users" SET "last_sign_in_at" = ?, "current_sign_in_at" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_sign_in_at", "2025-09-16 20:26:22.644660"], ["current_sign_in_at", "2025-09-16 20:54:15.806972"], ["sign_in_count", 7], ["updated_at", "2025-09-16 20:54:15.818801"], ["id", 2]]
---
  def complete_login(user)
    # Update login tracking
    user.update!(
      current_sign_in_at: Time.current,
      last_sign_in_at: user.current_sign_in_at,
      sign_in_count: user.sign_in_count + 1
    )