Backend/app/controllers/api/base_controller.rb

  def authenticate_request_optional
    token = extract_token_from_header

    if token
      begin
        decoded_token = JWT.decode(token, Rails.application.secret_key_base, true, { algorithm: 'HS256' })[0]
        @current_user = User.find(decoded_token['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]