Backend/app/controllers/api/v1/customers_controller.rb

SELECT "customers".* FROM "customers" ORDER BY "customers"."first_name" ASC, "customers"."last_name" ASC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "customers"
---
  def index
    @customers = Customer.all

    # Apply search filter if provided
    if params[:search].present?
      search_term = "%#{params[:search]}%"
      @customers = @customers.where(
        "first_name ILIKE ? OR last_name ILIKE ? OR email ILIKE ? OR phone ILIKE ?",
        search_term, search_term, search_term, search_term
      )
    end

    # Apply sorting
    case params[:sort_by]
    when 'name'
      @customers = @customers.order(:first_name, :last_name)
    when 'email'
      @customers = @customers.order(:email)
    when 'created_at'
      @customers = @customers.order(:created_at)
    else
      @customers = @customers.order(:first_name, :last_name)
    end

    # Simple pagination
    page = (params[:page] || 1).to_i
    per_page = (params[:per_page] || 20).to_i
    offset = (page - 1) * per_page

    @customers = @customers.limit(per_page).offset(offset)
    total_count = Customer.count

INSERT INTO "customers" ("first_name", "last_name", "email", "phone", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @customer = Customer.new(customer_params)

    if @customer.save