Backend/app/controllers/api/v1/products_controller.rb

  def index
    @products = Product.all

    # Apply filters if provided
    @products = @products.where("name ILIKE ?", "%#{params[:search]}%") if params[:search].present?
    @products = @products.where(category: params[:category]) if params[:category].present?
    @products = @products.where(active: params[:active]) if params[:active].present?

    case params[:stock_status]
    when 'in_stock'
      @products = @products.where('stock_quantity > 0')
    when 'low_stock'
      @products = @products.where('stock_quantity <= low_stock_threshold AND stock_quantity > 0')
    when 'out_of_stock'
      @products = @products.where(stock_quantity: 0)
    end

    # Apply sorting
    case params[:sort_by]
    when 'name'
      @products = @products.order(:name)
    when 'price'
      @products = @products.order(:price)
    when 'stock'
      @products = @products.order(:stock_quantity)
    else
      @products = @products.order(:name)
---
SELECT "products".* FROM "products" ORDER BY "products"."name" ASC

    offset = (page - 1) * per_page

    @products = @products.limit(per_page).offset(offset)
    total_count = Product.count
---
SELECT COUNT(*) FROM "products"

  def create
    Rails.logger.info "Creating product with params: #{product_params.inspect}"
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("name", "description", "price", "sku", "category", "stock_quantity", "low_stock_threshold", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    Rails.logger.info "Updating product #{@product.id} with params: #{product_params.inspect}"

    if @product.update(product_params)
---
UPDATE "products" SET "stock_quantity" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["stock_quantity", 25], ["updated_at", "2025-09-16 16:49:52.286902"], ["id", 17]]

  def destroy
    if @product.destroy
---
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 15]]

  def set_product
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]