Backend/app/controllers/api/v1/products_controller.rb

UPDATE "products" SET "stock_quantity" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["stock_quantity", 26], ["updated_at", "2025-09-16 18:38:53.542986"], ["id", 17]]
---
  def update
    Rails.logger.info "Updating product #{@product.id} with params: #{product_params.inspect}"

    if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 4]]
---
  def destroy
    if @product.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def set_product
    @product = Product.find(params[:id])