Backend/app/controllers/api/v1/sales_controller.rb

  def index
    @sales = Sale.includes(:user, :customer, :sale_items, :products).all

    # Apply filters if provided
    @sales = @sales.where(status: params[:status]) if params[:status].present?
    @sales = @sales.where(payment_method: params[:payment_method]) if params[:payment_method].present?
    @sales = @sales.where(user_id: params[:user_id]) if params[:user_id].present?

    # Date range filter
    if params[:start_date].present? && params[:end_date].present?
      start_date = Date.parse(params[:start_date])
      end_date = Date.parse(params[:end_date])
      @sales = @sales.where(created_at: start_date.beginning_of_day..end_date.end_of_day)
    end

    # Apply sorting
    case params[:sort_by]
    when 'created_at'
      @sales = @sales.order(created_at: :desc)
    when 'total_amount'
      @sales = @sales.order(:total_amount)
    when 'status'
      @sales = @sales.order(:status)
    else
      @sales = @sales.order(created_at: :desc)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" IN (?, ?)  [["id", 2], ["id", 1]]
SELECT "sale_items".* FROM "sale_items" WHERE "sale_items"."sale_id" IN (?, ?, ?)  [["sale_id", 3], ["sale_id", 2], ["sale_id", 1]]
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ?  [["id", 27]]
SELECT "products".* FROM "products" WHERE "products"."id" = ?  [["id", 17]]
SELECT "sale_items".* FROM "sale_items" WHERE "sale_items"."sale_id" = ?  [["sale_id", 17]]
SELECT "users".* FROM "users" WHERE "users"."id" = ?  [["id", 1]]
SELECT "customers".* FROM "customers" WHERE "customers"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)  [["id", 25], ["id", 23], ["id", 24], ["id", 7], ["id", 6], ["id", 5], ["id", 4], ["id", 3], ["id", 2], ["id", 1]]
SELECT "sale_items".* FROM "sale_items" WHERE "sale_items"."sale_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT COUNT(*) FROM "products"
SELECT COUNT(*) FROM "sales" WHERE "sales"."payment_method" = ?  [["payment_method", "credit_card"]]

    offset = (page - 1) * per_page

    @sales = @sales.limit(per_page).offset(offset)
    total_count = Sale.count
---
SELECT COUNT(*) FROM "sales"

  def create
    @sale = Sale.new(sale_params)
    @sale.user = current_user || User.first # Fallback to first user if no current_user

    if @sale.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "sales" ("total_amount", "tax_amount", "discount_amount", "status", "payment_method", "notes", "user_id", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def destroy
    if @sale.destroy
---
DELETE FROM "sales" WHERE "sales"."id" = ?  [["id", 17]]

  def stats
    today = Date.current
    this_month = today.beginning_of_month..today.end_of_month

    # Calculate real statistics
    today_sales = Sale.where(created_at: today.beginning_of_day..today.end_of_day).where(status: 'completed')
    month_sales = Sale.where(created_at: this_month).where(status: 'completed')

    # Get recent sales
    recent_sales = Sale.includes(:user, :customer)
                      .order(created_at: :desc)
                      .limit(5)

    stats = {
      today: {
        sales_count: today_sales.count,
        revenue: today_sales.sum(:total_amount).to_f
      },
      this_month: {
        sales_count: month_sales.count,
        revenue: month_sales.sum(:total_amount).to_f
      },
      average_sale: month_sales.any? ? (month_sales.average(:total_amount).to_f) : 0,
      recent_sales: recent_sales.as_json(
        include: {
          user: { only: [:id, :first_name, :last_name] },
          customer: { only: [:id, :first_name, :last_name] }
        },
        methods: [:receipt_number, :formatted_total, :customer_name]
      )
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" IN (?, ?)  [["id", 28], ["id", 27]]
SELECT "sales".* FROM "sales" ORDER BY "sales"."created_at" DESC LIMIT ?  [["LIMIT", 5]]
SELECT SUM("sales"."total_amount") FROM "sales" WHERE "sales"."created_at" BETWEEN ? AND ? AND "sales"."status" = ?  [["created_at", "2025-09-16 00:00:00"], ["created_at", "2025-09-16 23:59:59.999999"], ["status", "completed"]]
SELECT SUM("sales"."total_amount") FROM "sales" WHERE "sales"."created_at" BETWEEN ? AND ? AND "sales"."status" = ?  [["created_at", "2025-09-01"], ["created_at", "2025-09-30"], ["status", "completed"]]
SELECT "customers".* FROM "customers" WHERE "customers"."id" IN (?, ?, ?, ?, ?)  [["id", 6], ["id", 5], ["id", 4], ["id", 3], ["id", 2]]
SELECT SUM("sales"."total_amount") FROM "sales" WHERE "sales"."created_at" BETWEEN ? AND ? AND "sales"."status" = ?  [["created_at", "2025-09-17 00:00:00"], ["created_at", "2025-09-17 23:59:59.999999"], ["status", "completed"]]

  def set_sale
    @sale = Sale.find(params[:id])
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]