Backend/app/controllers/api/v1/sales_controller.rb

SELECT "sales".* FROM "sales" ORDER BY "sales"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
SELECT "users".* FROM "users" WHERE "users"."id" = ?  [["id", 1]]
INSERT INTO "sales" ("total_amount", "tax_amount", "discount_amount", "status", "payment_method", "notes", "user_id", "customer_id", "created_at", "updated_at", "anonymous_customer_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @sale = Sale.new(sale_params)
    @sale.user = current_user || User.first # Fallback to first user if no current_user

    if @sale.save

SELECT SUM("sales"."total_amount") FROM "sales" WHERE "sales"."created_at" BETWEEN ? AND ? AND "sales"."status" = ?  [["created_at", "2025-09-16 00:00:00"], ["created_at", "2025-09-16 23:59:59.999999"], ["status", "completed"]]
SELECT SUM("sales"."total_amount") FROM "sales" WHERE "sales"."created_at" BETWEEN ? AND ? AND "sales"."status" = ?  [["created_at", "2025-09-01"], ["created_at", "2025-09-30"], ["status", "completed"]]
SELECT 1 AS one FROM "sales" WHERE "sales"."created_at" BETWEEN ? AND ? AND "sales"."status" = ? LIMIT ?  [["created_at", "2025-09-01"], ["created_at", "2025-09-30"], ["status", "completed"], ["LIMIT", 1]]
---
  def stats
    today = Date.current
    this_month = today.beginning_of_month..today.end_of_month

    # Calculate real statistics
    today_sales = Sale.where(created_at: today.beginning_of_day..today.end_of_day).where(status: 'completed')
    month_sales = Sale.where(created_at: this_month).where(status: 'completed')

    # Payment method statistics for this month
    payment_methods_stats = calculate_payment_method_stats(month_sales)

    # Get recent sales
    recent_sales = Sale.includes(:user, :customer)
                      .order(created_at: :desc)
                      .limit(5)

    stats = {
      today: {
        sales_count: today_sales.count,
        revenue: today_sales.sum(:total_amount).to_f
      },
      this_month: {
        sales_count: month_sales.count,
        revenue: month_sales.sum(:total_amount).to_f
      },
      average_sale: month_sales.any? ? (month_sales.average(:total_amount).to_f) : 0,
      payment_methods: payment_methods_stats,
      recent_sales: recent_sales.as_json(
        include: {
          user: { only: [:id, :first_name, :last_name] },
          customer: { only: [:id, :first_name, :last_name] }
        },
        methods: [:receipt_number, :formatted_total, :customer_name]
      )