Backend/app/controllers/api/v1/sale_items_controller.rb

  def create
    @product = Product.find(params[:sale_item][:product_id])
    quantity = params[:sale_item][:quantity].to_i
    unit_price = (params[:sale_item][:unit_price] || @product.price).to_f

    # Check if product can be sold
    unless @product.can_sell?(quantity)
      return render json: {
        error: "Insufficient stock. Available: #{@product.stock_quantity}"
      }, status: :unprocessable_entity
    end

    # Check if item already exists in sale
    existing_item = @sale.sale_items.find_by(product: @product)
---
SELECT "sale_items".* FROM "sale_items" WHERE "sale_items"."sale_id" = ? AND "sale_items"."product_id" = ? LIMIT ?  [["sale_id", 2], ["product_id", 17], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]

        line_total: quantity * unit_price.to_f
      )

      if @sale_item.save
---
INSERT INTO "sale_items" ("quantity", "unit_price", "line_total", "sale_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["quantity", 2], ["unit_price", 40.53], ["line_total", 81.06], ["sale_id", 5], ["product_id", 17], ["created_at", "2025-09-16 15:48:10.857861"], ["updated_at", "2025-09-16 15:48:10.857861"]]

  def set_sale
    @sale = Sale.find(params[:sale_id])
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]