Backend/app/controllers/api/v1/sales_controller.rb

SELECT COUNT(*) FROM "sales"
DELETE FROM "sales" WHERE "sales"."id" = ?  [["id", 17]]
---
  def destroy_all
    # Only allow admins to delete all sales
    unless current_user&.admin?
      render json: { error: 'Unauthorized. Admin access required.' }, status: :forbidden
      return
    end

    begin
      deleted_count = Sale.count
      Sale.destroy_all

SELECT "customers".* FROM "customers" WHERE "customers"."id" IN (?, ?, ?, ?)  [["id", 5], ["id", 4], ["id", 3], ["id", 2]]
SELECT "sales".* FROM "sales" ORDER BY "sales"."created_at" DESC LIMIT ?  [["LIMIT", 5]]
---
  def stats
    today = Date.current
    this_month = today.beginning_of_month..today.end_of_month

    # Calculate real statistics
    today_sales = Sale.where(created_at: today.beginning_of_day..today.end_of_day).where(status: 'completed')
    month_sales = Sale.where(created_at: this_month).where(status: 'completed')

    # Payment method statistics for this month
    payment_methods_stats = calculate_payment_method_stats(month_sales)

    # Get recent sales
    recent_sales = Sale.includes(:user, :customer)
                      .order(created_at: :desc)
                      .limit(5)

    stats = {
      today: {
        sales_count: today_sales.count,
        revenue: today_sales.sum(:total_amount).to_f
      },
      this_month: {
        sales_count: month_sales.count,
        revenue: month_sales.sum(:total_amount).to_f
      },
      average_sale: month_sales.any? ? (month_sales.average(:total_amount).to_f) : 0,
      payment_methods: payment_methods_stats,
      recent_sales: recent_sales.as_json(
        include: {
          user: { only: [:id, :first_name, :last_name] },
          customer: { only: [:id, :first_name, :last_name] }
        },
        methods: [:receipt_number, :formatted_total, :customer_name]
      )

SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def set_sale
    @sale = Sale.find(params[:id])